Revit 2017 API
StructuralSectionCParallelFlange Class
 Defines parameters for C-channel Parallel Flange structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public class StructuralSectionCParallelFlange : StructuralSectionHotRolled
Visual Basic
Public Class StructuralSectionCParallelFlange _
	Inherits StructuralSectionHotRolled
Visual C++
public ref class StructuralSectionCParallelFlange : public StructuralSectionHotRolled
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCParallelFlange
See Also
StructuralSectionCParallelFlange Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace